#include <iostream>
#include <cmath>

#define инт int
#define вывод std::cout
#define конецстроки std::endl;
#define больше <
#define символы <<
#define мэин main
#define фигурнаяскобканачало {
#define фигурнаяскобкаконец }
#define скобканачало (
#define скобкаконец )
#define квадратныйкорень sqrt
#define если if
#define иначе else
#define еслине else if
#define равно =
#define точноравно ==
#define окончание ;

инт мэин скобканачало скобкаконец фигурнаяскобканачало
	если скобканачало квадратныйкорень скобканачало 25 скобкаконец точноравно 5 скобкаконец фигурнаяскобканачало
		вывод символы квадратныйкорень скобканачало 25 скобкаконец символы конецстроки окончание
	фигурнаяскобкаконец иначе фигурнаяскобканачало
		вывод символы "что-то неверно" символы конецстроки окончание
	фигурнаяскобкаконец
фигурнаяскобкаконец