//ТУТ БУДЕТ СОБРАНО МАКСИМАЛЬНО ВОЗМОЖНОЕ КОЛИЧЕСТВО ВАРИАЦИЙ И ЧИСЕЛ!
//цифры
#define ноль   0
#define один   1
#define два    2
#define три    3
#define четыре 4
#define пять   5
#define шесть  6
#define семь   7
#define восемь 8
#define девять 9
//числа...
#define десять 10
#define одиннадцать 11
#define двенадцать 12
#define тринадцать 13
#define четырнадцать 14
#define пятнадцать 15
#define шестнадцать 16
#define семнадцать 17
#define восемнадцать 18
#define девятнадцать 19
#define двадцать 20
#define двадцатьодин 21
#define двадцатьдва 22
#define двадцатьтри 23
#define двадцатьчетыре 24
#define двадцатьпять 25