//ТУТ БУДЕТ СОБРАНО МАКСИМАЛЬНО ВОЗМОЖНОЕ КОЛИЧЕСТВО ВАРИАЦИЙ И ЧИСЕЛ!
//цифры
#define ноль   0
#define один   1
#define два    2
#define три    3
#define четыре 4
#define пять   5
#define шесть  6
#define семь   7
#define восемь 8
#define девять 9
//числа...
//10-20
#define десять 10
#define одиннадцать 11
#define двенадцать 12
#define тринадцать 13
#define четырнадцать 14
#define пятнадцать 15
#define шестнадцать 16
#define семнадцать 17
#define восемнадцать 18
#define девятнадцать 19
#define двадцать 20
//21-30
#define двадцатьодин 21
#define двадцатьдва 22
#define двадцатьтри 23
#define двадцатьчетыре 24
#define двадцатьпять 25
#define двадцатьшесть 26
#define	двадцатьсемь 27
#define	двадцатьвосемь 28
#define	двадцатьдевять 29
#define	тридцать 30
//31-40
#define сорок 40
//41-50
#define пятьдесят 50
//51-60
#define шестьдесят 60
//61-70
#define семьдесят 70
//71-80
#define восемьдесят 80
//81-90
#define девяносто 90
//91-100
#define сто 100